[
  "obsidian-excalidraw-plugin",
  "obsidian-git",
  "obsidian-dictionary-plugin",
  "obsidian-jupyter",
  "obsidian-discordrpc",
  "obsidian-icon-folder",
  "obsidian-collapse-all-plugin",
  "obsidian-reminder-plugin",
  "obsidian-kanban",
  "waypoint"
]